<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Queries Order </h1>

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In SQL, the logical query processing order defines the sequence in which the different clauses of a SQL query are evaluated. 
<ul>The general logical query processing order is as follows
    <br><br><ol>FROM: Specifies the tables or views from which the data will be retrieved.</ol>
    <ol>WHERE: Filters the rows based on a specified condition.</ol>
    <ol>GROUP BY: Groups the result set by one or more columns.</ol>
    <ol>HAVING: Filters the groups based on a specified condition.</ol>
    <ol>SELECT: Specifies the columns to be included in the result set.</ol>
    <ol>DISTINCT: Removes duplicate rows from the result set.</ol>
    <ol>ORDER BY: Sorts the result set based on specified columns.</ol>
    <ol>LIMIT: Limits the number of rows returned or skips a specified number of rows.</ol>


</ul>


</div>

<img style="display: block;margin-left: auto;margin-right: auto;width: 80%; " src="./sql_images/order.png">

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/mydb

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 1: FROM clause - Identify the table and relationships</div>

In [4]:
%%sql

-- Retrieve brand_name, model, rating, and price from the 'mobile' table

SELECT 
    brand_name,
    model,
    rating,
    price
FROM 
    mobile

LIMIT 5 # ignore limit

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('oneplus', 'OnePlus Nord CE 2 Lite 5G', 81.0, 19989),
 ('samsung', 'Samsung Galaxy A14 5G', 75.0, 16499),
 ('samsung', 'Samsung Galaxy F23 5G (6GB RAM + 128GB)', 80.0, 16999),
 ('realme', 'Realme 10 Pro', 82.0, 18999),
 ('vivo', 'Vivo T1 5G (6GB RAM + 128GB)', 80.0, 16990)]

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 2: WHERE clause - Filter rows based on conditions</div>

In [9]:
%%sql
-- Retrieve brand_name, model, rating, and price where rating is greater than 4
SELECT 
    brand_name,
    model,
    rating,
    price
FROM 
    mobile
WHERE 
    rating < 70

LIMIT 5 # ignore limit

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('jio', 'Jio JioPhone 5G', 64.0, 11990),
 ('vivo', 'Vivo Y21 2021', 69.0, 13489),
 ('samsung', 'Samsung Galaxy F04', 68.0, 8499),
 ('tecno', 'Tecno Spark Go 2023', 62.0, 6999),
 ('samsung', 'Samsung Galaxy M04', 66.0, 8499)]

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 3: GROUP BY clause - Group rows based on specified columns</div>

In [11]:
%%sql

-- Group average rating by brand_name
SELECT 
    brand_name,
    AVG(rating) AS avg_rating
FROM 
    mobile
GROUP BY 
    brand_name

LIMIT 5 # ignore limit

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('cola', 74.0),
 ('doogee', 86.0),
 ('honor', 75.0),
 ('huawei', 81.0),
 ('infinix', 77.8)]

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 4: HAVING clause - Further filter grouped rows</div>

In [14]:
%%sql

-- Group average rating by brand_name, only include groups with average rating greater than 4
SELECT 
    brand_name,
    AVG(rating) AS avg_rating
FROM 
    mobile
GROUP BY 
    brand_name
HAVING 
    AVG(rating) < 70

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[('itel', 61.0), ('jio', 64.0)]

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 5: SELECT clause - Retrieve specified columns
</div>

In [27]:
%%sql

-- Retrieve brand_name, model, and calculate total value (rating * price) where rating is greater than 4
SELECT 
    brand_name,
    model,
    rating * price AS total_value
FROM 
    mobile
WHERE 
    rating < 65

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('jio', 'Jio JioPhone 5G', 767360.0),
 ('tecno', 'Tecno Spark Go 2023', 433938.0),
 ('xiaomi', 'Xiaomi Redmi A1 Plus', 437340.0),
 ('nokia', 'Nokia C31', 588938.0),
 ('realme', 'Realme C30s (4GB RAM + 64GB)', 557380.0),
 ('itel', 'itel Vision 3', 408639.0),
 ('poco', 'Poco C50 (3GB RAM + 32GB)', 445239.0),
 ('realme', 'Realme Narzo 50i Prime', 487939.0),
 ('xiaomi', 'Xiaomi Redmi A1 Plus (3GB RAM + 32GB)', 512339.0),
 ('realme', 'Realme Narzo 50i Prime (4GB RAM + 64GB)', 558080.0)]


<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 6: ORDER BY clause - Sort the result set

</div>

In [28]:
%%sql

-- Retrieve brand_name, model, and calculate total value (rating * price), then order by total_value in descending order
SELECT 
    brand_name,
    model,
    rating * price AS total_value
FROM 
    mobile
WHERE 
    rating < 65
ORDER BY 
    total_value DESC;

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('jio', 'Jio JioPhone 5G', 767360.0),
 ('nokia', 'Nokia C31', 588938.0),
 ('realme', 'Realme Narzo 50i Prime (4GB RAM + 64GB)', 558080.0),
 ('realme', 'Realme C30s (4GB RAM + 64GB)', 557380.0),
 ('xiaomi', 'Xiaomi Redmi A1 Plus (3GB RAM + 32GB)', 512339.0),
 ('realme', 'Realme Narzo 50i Prime', 487939.0),
 ('poco', 'Poco C50 (3GB RAM + 32GB)', 445239.0),
 ('xiaomi', 'Xiaomi Redmi A1 Plus', 437340.0),
 ('tecno', 'Tecno Spark Go 2023', 433938.0),
 ('itel', 'itel Vision 3', 408639.0)]


<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Step 7: LIMIT clause - Limit the result set

</div>

In [29]:
%%sql

-- Retrieve brand_name, model, and calculate total value (rating * price), then order by total_value in descending order, and limit to the top 10 results
SELECT 
    brand_name,
    model,
    rating * price AS total_value
FROM 
    mobile
WHERE 
    rating > 4
ORDER BY 
    total_value DESC
LIMIT 
    10;

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('huawei', 'Huawei Mate 50 RS Porsche Design', 19439919.0),
 ('samsung', 'Samsung Galaxy S20 Plus', 7304000.0),
 ('samsung', 'Samsung Galaxy S10 5G', 6793140.0),
 ('samsung', 'Samsung Galaxy S20 5G', 6674911.0),
 ('samsung', 'Samsung Galaxy Note 10 Plus', 5250911.0),
 ('doogee', 'Doogee V Max', 4047912.0),
 ('samsung', 'Samsung Galaxy S20', 3695912.0),
 ('nokia', 'Nokia X30', 3569150.0),
 ('samsung', 'Samsung Galaxy S10 Plus', 3482919.0),
 ('samsung', 'Samsung Galaxy A82 5G', 3439140.0)]